TProfileST3/casebase/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 438.18;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 438.15;
    }
    "ES.*"
    {
        type            zeroGradient;
    }
    "IS.*"
    {
        type            zeroGradient;
    }
    walls
    {
        type            fixedValue;
        value           uniform 448.15;
    }
}


// ************************************************************************* //
