TProfileST3/casebase/system/centerofmass
(-4.19 65.75 0.78);
