TProfileST3/casebase/system/outletAreas
IS1 2.999999999999999e-06;
ES1 3.6999999999999985e-05;
ES2 2.7e-05;
inlet 0.002827433388230814;
walls 0.014849564761957203;
